v2206/MSc_icedAirfoil/Meshing_ice_3/+10deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    west
    {
        type            patch;
        nFaces          24;
        startFace       47203;
    }
    east
    {
        type            patch;
        nFaces          24;
        startFace       47227;
    }
    north
    {
        type            patch;
        nFaces          48;
        startFace       47251;
    }
    south
    {
        type            patch;
        nFaces          48;
        startFace       47299;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23569;
        startFace       47347;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23569;
        startFace       70916;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          736;
        startFace       94485;
    }
)

// ************************************************************************* //
